Конфигурация/Catalogs/ИнвестиционныеДекларации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ИнвестиционныеДекларации</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Консолидирующая</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьМинимальноеЗначениеРейтинга</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьЦелевоеЗначение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчастиеВГолосовании</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипИнвестиционнойДекларации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыИнвестиционныхДеклараций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СовокупныйКонтроль</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Показатели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Базис</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БазисыКонтроляИнвестиционныхДеклараций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтролируемыйПоказатель</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МинимальноеЗначение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МаксимальноеЗначение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АбсолютнаяВеличинаМин</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АбсолютнаяВеличинаМакс</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъединятьОтборы</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаборИнвестиционнойДекларации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НаборыИнвестиционныхДеклараций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИнвестиционнаяДекларация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИнвестиционныеДекларации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦелевоеЗначение</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АбсолютнаяВеличинаЦель</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВнутреннийНабор</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОпределяетСоставИСтруктуру</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСКДБазиса</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МакетКомпоновки</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСКДНабора</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Эмитент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГруппаЭмитентов</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВключаяФилиалы</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦеннаяБумага</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БазовыеСтавкиОблигаций</v8:Type>
								<v8:Type>cfg:CatalogRef.ВалютныеПары</v8:Type>
								<v8:Type>cfg:CatalogRef.Векселя</v8:Type>
								<v8:Type>cfg:CatalogRef.Облигации</v8:Type>
								<v8:Type>cfg:CatalogRef.ПроизводныеФинансовыеИнструменты</v8:Type>
								<v8:Type>cfg:CatalogRef.Паи</v8:Type>
								<v8:Type>cfg:CatalogRef.ДепозитарныеРасписки</v8:Type>
								<v8:Type>cfg:CatalogRef.Доли</v8:Type>
								<v8:Type>cfg:CatalogRef.Закладные</v8:Type>
								<v8:Type>cfg:CatalogRef.ИпотечныеСертификатыУчастия</v8:Type>
								<v8:Type>cfg:CatalogRef.Акции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГруппаЦенныхБумаг</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтрокиПоказателей</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаЗапретаПокупки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗапасМин</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗапасМакс</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачалаДействия</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ГруппыЭмитентов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Эмитенты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Группа</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Эмитент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ГруппыЦенныхБумаг</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЦенныеБумаги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Группа</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦеннаяБумага</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БазовыеСтавкиОблигаций</v8:Type>
								<v8:Type>cfg:CatalogRef.ВалютныеПары</v8:Type>
								<v8:Type>cfg:CatalogRef.Векселя</v8:Type>
								<v8:Type>cfg:CatalogRef.Облигации</v8:Type>
								<v8:Type>cfg:CatalogRef.ПроизводныеФинансовыеИнструменты</v8:Type>
								<v8:Type>cfg:CatalogRef.Паи</v8:Type>
								<v8:Type>cfg:CatalogRef.ДепозитарныеРасписки</v8:Type>
								<v8:Type>cfg:CatalogRef.Доли</v8:Type>
								<v8:Type>cfg:CatalogRef.Закладные</v8:Type>
								<v8:Type>cfg:CatalogRef.ИпотечныеСертификатыУчастия</v8:Type>
								<v8:Type>cfg:CatalogRef.Акции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СчетаДоверительногоУправления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СчетДоверительногоУправления</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Конфигурация/Catalogs/ИнвестиционныеДекларации/Forms/ФормаПодбораНастроек/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтаФорма.УникальныйИдентификаторВладельца = Параметры.УникальныйИдентификаторВладельца;
	ЭтаФорма.Организация = Параметры.Организация;
	
	Элементы.СтрокиИсточникИнвестиционнаяДекларация.Видимость = Параметры.Консолидирующая;
	Элементы.СтрокиПриемникИнвестиционнаяДекларация.Видимость = Параметры.Консолидирующая;
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СтрокиИсточникВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтрокаИсточник = ЭтаФорма.СтрокиИсточник.НайтиПоИдентификатору(ВыбраннаяСтрока);
	ЗаполнитьЗначенияСвойств(ЭтаФорма.СтрокиПриемник.Добавить(), СтрокаИсточник);
	БазисПриИзмененииНаСервере(СтрокаИсточник.Базис);
КонецПроцедуры

&НаКлиенте
Процедура НастройкаИсточникПриИзменении(Элемент)
	ЗаполнитьСтрокиИсточник();
КонецПроцедуры

&НаКлиенте
Процедура ОписаниеУсловийОтбораПриИзменении(Элемент)
	ЗаполнитьСтрокиИсточник();
КонецПроцедуры

&НаКлиенте
Процедура СтрокиПриемникПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СтрокиПриемникПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	МассивНовыхСтрок = Новый Массив;
	Для каждого СтрокаИсточник Из ПараметрыПеретаскивания.Значение Цикл
		НоваяСтрока = ЭтаФорма.СтрокиПриемник.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаИсточник);
		МассивНовыхСтрок.Добавить(НоваяСтрока.ПолучитьИдентификатор());
	КонецЦикла;
	ЗаполнитьПараметрыБазисов(МассивНовыхСтрок);
	
КонецПроцедуры

&НаКлиенте
Процедура СтрокиПриемникБазисПриИзменении(Элемент)
	БазисПриИзмененииНаСервере(Элементы.Показатели.ТекущиеДанные.Базис);
КонецПроцедуры

&НаКлиенте
Процедура СтрокиПриемникКонтролируемыйПоказательНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	             
	ТекущийБазис = Элементы.СтрокиПриемник.ТекущиеДанные.Базис;
	НайденныеСтроки = ПараметрыБазисов.НайтиСтроки(Новый Структура("Базис", Элементы.СтрокиПриемник.ТекущиеДанные.Базис));
	Если НайденныеСтроки.Количество() > 0 Тогда
	
		СтандартнаяОбработка = Ложь;
		ДанныеВыбора = НайденныеСтроки[0].Показатели;
	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

#Область КомандыФормы

&НаКлиенте
Процедура ПеренестиВНастройку(Команда)
	Закрыть(ПеренестиВНастройкуНаСервере());
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьСтрокиИсточник()

	СтрокиИсточник.Очистить();
	
	Запрос = Новый Запрос;
	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ИнвестиционныеДекларацииПоказатели.Ссылка КАК Настройка,
		|	ИнвестиционныеДекларацииПоказатели.НомерСтроки КАК НомерСтроки,
		|	ИнвестиционныеДекларацииПоказатели.Базис КАК Базис,
		|	ИнвестиционныеДекларацииПоказатели.НаборИнвестиционнойДекларации КАК НаборИнвестиционнойДекларации,
		|	ИнвестиционныеДекларацииПоказатели.КонтролируемыйПоказатель КАК КонтролируемыйПоказатель,
		|	ИнвестиционныеДекларацииПоказатели.МинимальноеЗначение КАК МинимальноеЗначение,
		|	ИнвестиционныеДекларацииПоказатели.МаксимальноеЗначение КАК МаксимальноеЗначение,
		|	ИнвестиционныеДекларацииПоказатели.АбсолютнаяВеличинаМин КАК АбсолютнаяВеличинаМин,
		|	ИнвестиционныеДекларацииПоказатели.АбсолютнаяВеличинаМакс КАК АбсолютнаяВеличинаМакс,
		|	ИнвестиционныеДекларацииПоказатели.ОбъединятьОтборы КАК ОбъединятьОтборы,
		|	ИнвестиционныеДекларацииПоказатели.ИнвестиционнаяДекларация КАК ИнвестиционнаяДекларация
		|ИЗ
		|	Справочник.ИнвестиционныеДекларации.Показатели КАК ИнвестиционныеДекларацииПоказатели
		|ГДЕ
		|	&НастройкаИсточник
		|	И &ПредставлениеУсловийОтбора";
	
	Если ЗначениеЗаполнено(ЭтаФорма.НастройкаИсточник) Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&НастройкаИсточник", "ИнвестиционныеДекларацииПоказатели.Ссылка = &НастройкаИсточник");
		Запрос.УстановитьПараметр("НастройкаИсточник", ЭтаФорма.НастройкаИсточник);
	Иначе
		Запрос.УстановитьПараметр("НастройкаИсточник", Истина);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭтаФорма.ОписаниеУсловийОтбора) Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПредставлениеУсловийОтбора", 
			"ИнвестиционныеДекларацииПоказатели.НаборИнвестиционнойДекларации.Наименование ПОДОБНО &ПредставлениеУсловийОтбора
			|	ИЛИ ИнвестиционныеДекларацииПоказатели.НаборИнвестиционнойДекларации.Описание ПОДОБНО &ПредставлениеУсловийОтбора");
		Запрос.УстановитьПараметр("ПредставлениеУсловийОтбора", "%" + СокрЛП(ЭтаФорма.ОписаниеУсловийОтбора) + "%");
	Иначе
		Запрос.УстановитьПараметр("ПредставлениеУсловийОтбора", Истина);
	КонецЕсли; 
	
	Запрос.Текст = ТекстЗапроса;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(СтрокиИсточник.Добавить(), ВыборкаДетальныеЗаписи);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПеренестиВНастройкуНаСервере()
	
	ТаблицаПриемник = СтрокиПриемник.Выгрузить();
	Возврат ПоместитьВоВременноеХранилище(ТаблицаПриемник, УникальныйИдентификаторВладельца);
	
КонецФункции

&НаСервере
Процедура ЗаполнитьПараметрыБазиса(СтрокаБазиса, Базис)

	Если ЗначениеЗаполнено(Базис) Тогда
		
		ТаблицаПоказателей = Справочники.БазисыКонтроляИнвестиционныхДеклараций.ПолучитьОписаниеКонтролируемыхПоказателей(Базис.НаборДанных);
		СтрокаБазиса.Показатели.Очистить();
		
		Для каждого Показатель Из ТаблицаПоказателей Цикл
		
			СтрокаБазиса.Показатели.Добавить(Показатель.Представление);
		
		КонецЦикла; 
		
		СтрокаБазиса.Базис = Базис;
		
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура БазисПриИзмененииНаСервере(Базис)

	НайденныеСтроки = ПараметрыБазисов.НайтиСтроки(Новый Структура("Базис", Базис));
	
	Если НайденныеСтроки.Количество() = 0 Тогда
		СтрокаБазиса = ПараметрыБазисов.Добавить();
	Иначе
		СтрокаБазиса = НайденныеСтроки[0];
	КонецЕсли; 
	
	ЗаполнитьПараметрыБазиса(СтрокаБазиса, Базис);

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПараметрыБазисов(МассивСтрок)
	
	Для каждого ИдентификаторСтроки Из МассивСтрок Цикл
		
		СтрокаПриемник = ЭтаФорма.СтрокиПриемник.НайтиПоИдентификатору(ИдентификаторСтроки);
		БазисПриИзмененииНаСервере(СтрокаПриемник.Базис);
		
	КонецЦикла; 
	
КонецПроцедуры

#КонецОбласти
